hw2-flatPlate/yPlus1/system/graphs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/


// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

// Override settings here, e.g.
// setConfig { type midPoint; }

type            sets;
libs            ("libsampling.so");

writeControl    writeTime;

interpolationScheme cellPoint;

setFormat   raw;

setConfig
{
    type    midPoint;  // midPoint
    axis    distance;  // x, y, z, xyz
}

sets
(
    lineA
    {
        $setConfig;
        start (0.97 0.0 0);
        end   (0.97 0.02 0);
    }
    lineB
    {
        $setConfig;
        start (1.90 0.0 0);
        end   (1.90 0.02 0);
    }

);

fields  (U);

// ************************************************************************* //
